Revit 2017 API
TemporaryViewModes Class
 A data structure containing data related to temporary view modes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016 Subscription Update
Syntax
C#
public class TemporaryViewModes : APIObject
Visual Basic
Public Class TemporaryViewModes _
	Inherits APIObject
Visual C++
public ref class TemporaryViewModes : public APIObject
Remarks
The class contains methods and properties to manipulate states of various temporary view modes that may or may not be avilable in any of visible views of a Revit document. The temporary modes are enumerated in the TemporaryViewMode class.
Every view that supports temporary view modes owns an instance of this TemporaryViewModes class, which can be obtained by accessing the TemporaryViewModes property of the View class. Note that views which do not support temporary modes will have that property's value be Null.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.TemporaryViewModes
See Also
TemporaryViewModes Members
Autodesk.Revit.DB Namespace